--============================================
-- 广义距离
--============================================
-- 圆心距离
function distance(c)
	return math.sqrt(c.x*c.x + c.y*c.y);
end
----------------------------------------------
-- 点到点距离
----------------------------------------------
function d_p2p(p, o)
	return length(p-o)
end
----------------------------------------------
-- 旋转连杆
----------------------------------------------
-- 特征到位置函数
function d_link2p(p, o)
	--c: r,th,0 | o: x, y, 0
	--local p = link_p(c);
	--prt(p.x .. "," .. p.y .. "," .. p.z)
	--pixi(100+p.x,100+p.y)
	--msgbox(length(p-o))
	return length(p-o)
end